AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/CommonModules/ОбновлениеИнформационнойБазыТК/Module.bsl
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
    Описание.Имя = "ТК";
    Описание.Версия = "1.0.1.25";
    // Требуется библиотека стандартных подсистем.
	
	//Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	//Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "2.3.3.20";

    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	#Область НачальноеЗаполнение
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыТК.ПервыйЗапуск";
	Обработчик.Комментарий = НСтр("ru='Инициализация настроек программы при первом запуске.';uk='Ініціалізація налаштувань програми при першому запуску.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыТК.СоздатьВидыКонтактнойИнформации";
	Обработчик.Комментарий = НСтр("ru='Выполняется заполнение видов контактной информации';uk='Виконується заповнення видів контактної інформації'");

	
	#КонецОбласти

	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "Справочники.ВидыДоговоров.НачальноеЗаполнение";
	Обработчик.Комментарий = НСтр("ru='Выполняется заполнение видов договоров';uk='Виконується заповнення видів договорів'");
	Обработчик.НачальноеЗаполнение = Ложь;

	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия      = "1.0.1.7";
	Обработчик.Процедура   = "ОбновлениеИнформационнойБазыТК.ОбновитьНаборыСвойствДополнительныхРеквизитовИСведений";
	Обработчик.Комментарий = НСтр("ru='Подключение новых объектов к подсистеме Свойства.';uk='Підключення нових об`єктів до підсистеми Властивості.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия      = "1.0.1.18";
	Обработчик.Процедура   = "Справочники.ТорговыеПлощадки.СоздатьВидыКонтактнойИнформацци";
	Обработчик.Комментарий = НСтр("ru='Выполняется заполнение видов контактной информации Торговые площадки';uk='Виконується заповнення видів контактної інформації Торгові майданчики'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.23";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыТК.ОбновитьНовыеПредопределенныеДополнительныеСвойства";
	Обработчик.Комментарий = НСтр("ru = 'Выполняется заполнение дополнительного свойства'; uk = 'Виконується заповнення додаткових властивостей'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.24";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыТК.СоздатьВидыКонтактнойИнформации24";
	Обработчик.Комментарий = НСтр("ru='Выполняется заполнение видов контактной информации';uk='Виконується заповнення видів контактної інформації'");

КонецПроцедуры



Процедура ПередОбновлениемИнформационнойБазы() Экспорт
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
        Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры
	
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры 

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
КонецПроцедуры


Процедура ПервыйЗапуск()Экспорт
	
	Справочники.ВидыДоговоров.НачальноеЗаполнение();	
	РегистрыСведений.ШтрихкодыНоменклатуры.ЗаполнитьКонстантыПодсистемыШтрихкодирования();

КонецПроцедуры

Процедура СоздатьВидыКонтактнойИнформации() Экспорт
	
	// Контактная информация справочника "Организации"
	
	#Область Организации
	
	ГруппаКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
	ГруппаКонтактнойИнформации.Имя          = "СправочникОрганизации";
	ГруппаКонтактнойИнформации.Наименование = НСтр("ru = 'Контактная информация справочника ""Организации""';uk='Контактна інформація довідника ""Організації""'");
	
	Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);
	
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Вид.Имя          = "ЮридическийАдресОрганизации";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Юридический адрес организации';uk='Юридична адреса організації'");
	Вид.Порядок      = 1;
	Вид.МожноИзменятьСпособРедактирования         = Истина;
	Вид.ВидРедактирования                         = "Диалог";
	Вид.ХранитьИсториюИзменений                   = Истина;
	Вид.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Вид.Имя          = "ФактическийАдресОрганизации";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Фактический адрес организации';uk='Фактична адреса організації'");
	Вид.Порядок      = 2;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Вид.Имя          = "ПочтовыйАдресОрганизации";
	Вид.Группа        = Группа;
	Вид.Наименование = НСтр("ru = 'Почтовый адрес организации';uk='Поштова адреса організації'");
	Вид.Порядок      = 3;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	Вид.Имя          = "ТелефонОрганизации";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Телефон организации';uk='Телефон організації'");
	Вид.Порядок      = 4;
	Вид.МожноИзменятьСпособРедактирования           = Истина;
	Вид.РазрешитьВводНесколькихЗначений             = Истина;
	Вид.НастройкиПроверки.ТелефонCДобавочнымНомером = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Вид.Имя          = "EmailОрганизации";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Email организации';uk='Email організації'");
	Вид.Порядок      = 5;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.РазрешитьВводНесколькихЗначений   = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	Вид.Имя          = "ДругаяИнформацияОрганизации";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Другая информация организации';uk='Інша інформація організації'");
	
	Вид.Порядок      = 6;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидПоляДругое = "ОднострочноеШирокое";
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	#КонецОбласти
	
	// Контактная информация справочника "Контрагенты"
	#Область Контрагенты
	
	  	
	ГруппаКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
	ГруппаКонтактнойИнформации.Имя          = "СправочникКонтрагенты";
	ГруппаКонтактнойИнформации.Наименование = НСтр("ru = 'Контактная информация справочника ""Контрагенты""';uk='Контактна інформація довідника ""Контрагенти""'");
	
	Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);

	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Вид.Имя = "АдресКонтрагента";
	Вид.Наименование = НСтр("ru = 'Фактический адрес контрагента';uk='Фактична адреса контрагента'");
	Вид.Группа = Группа;
	Вид.МожноИзменятьСпособРедактирования         = Истина;
	Вид.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	

	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Вид.Имя = "EmailКонтрагента";
	Вид.Наименование = НСтр("ru = 'Email контрагента';uk='Email контрагента'");
	Вид.Группа = Группа;
	Вид.РазрешитьВводНесколькихЗначений = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);

	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Skype);
	Вид.Имя = "SkypeКонтрагента";
	Вид.Наименование = НСтр("ru = 'Skype контрагента';uk='Skype контрагента'");

	Вид.Группа = Группа;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	

	
	#КонецОбласти
	
	
	
	
	
КонецПроцедуры

Процедура СоздатьВидыКонтактнойИнформации24() Экспорт
	
	  	
	ГруппаКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
	ГруппаКонтактнойИнформации.Имя          = "СправочникКонтрагенты";
	ГруппаКонтактнойИнформации.Наименование = НСтр("ru = 'Контактная информация справочника ""Контрагенты""';uk='Контактна інформація довідника ""Контрагенти""'");
	
	Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);

	
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Вид.Имя          = "ЮридическийАдресКонтрагента";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Юридический адрес контрагента';uk='Юридична адреса контрагента'");
	Вид.МожноИзменятьСпособРедактирования         = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	Вид.Имя          = "КонтактныйТелефонКонтрагента";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Контактный телефон контрагента';uk='Контактний телефон контрагента'");
	Вид.НастройкиПроверки.ТелефонCДобавочнымНомером = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);

	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Вид.Имя          = "EmailКонтрагентаДляСверки";
	Вид.Группа        = Группа;
	Вид.Наименование = НСтр("ru = 'Email адрес для сверки';uk='Email адреса для звірки'");
	Вид.МожноИзменятьСпособРедактирования = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	ГруппаКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
	ГруппаКонтактнойИнформации.Имя          = "СправочникТК_КонтактныеЛица";
	ГруппаКонтактнойИнформации.Наименование = НСтр("ru = 'Контактная информация справочника ""Контактные лица""';uk='Контактна інформація довідника ""Контактні особи""'");
	
	Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформации);

	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Вид.Имя          = "EmailКонтактныеЛица";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Email Контактные лица';uk='Email Контактні особи'");
	Вид.Порядок      = 1;
	Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.РазрешитьВводНесколькихЗначений   = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	Вид.Имя          = "ТелефонКонтактногоЛица";
	Вид.Группа       = Группа;
	Вид.Наименование = НСтр("ru = 'Контактный телефон';uk='Контактний телефон'");
	Вид.Порядок      = 2;
	Вид.НастройкиПроверки.ТелефонCДобавочнымНомером = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);

	
	
КонецПроцедуры


Процедура ОбновитьНаборыСвойствДополнительныхРеквизитовИСведений() Экспорт
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПоступлениеТоваров");
	
КонецПроцедуры

Процедура ОбновитьНовыеПредопределенныеДополнительныеСвойства() Экспорт 
	
	ТаблицаСвойств = Новый Соответствие;
	
	// РезервРаспечатан
	СвойствоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.РезервРаспечатан;
	
	Элемент = СвойствоСсылка.ПолучитьОбъект();
	Элемент.Наименование = НСтр("ru = 'Разерв распечатан'; uk = 'Резерв роздрукований'");
	Элемент.Имя = "РезервРаспечатан";
	Элемент.ИдентификаторДляФормул = "РезервРаспечатан";
	Элемент.Виден = Истина;
	Элемент.ВыводитьВВидеГиперссылки = Ложь;
	Элемент.ДополнительныеЗначенияИспользуются = Ложь;
	Элемент.ДополнительныеЗначенияСВесом = Ложь;
	Элемент.Доступен = Истина;
	Элемент.Заголовок = НСтр("ru = 'Разерв распечатан'; uk = 'Резерв роздрукований'");
	Элемент.ЗаполнятьОбязательно = Ложь;
	Элемент.ЭтоДополнительноеСведение = Истина;
	НайденнаяСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Резервирование заказов покупателя");
	Элемент.НаборСвойств = НайденнаяСсылка;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	
	ТаблицаСвойств.Вставить(СвойствоСсылка, Новый Структура("ОбъектСвойство, НаборСвойств, ИмяНабора", 
																Элемент, 
																НайденнаяСсылка, 
																"Документ_РезервированиеЗаказовПокупателя"));
																
	// ЕстьОригинал
	СвойствоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ЕстьОригинал;
	
	Элемент = СвойствоСсылка.ПолучитьОбъект();
	Элемент.Наименование = НСтр("ru = 'Есть оригинал'; uk = 'Є оригінал'");
	Элемент.Имя = "ЕстьОригинал";
	Элемент.ИдентификаторДляФормул = "ЕстьОригинал";
	Элемент.Виден = Истина;
	Элемент.ВыводитьВВидеГиперссылки = Ложь;
	Элемент.ДополнительныеЗначенияИспользуются = Ложь;
	Элемент.ДополнительныеЗначенияСВесом = Ложь;
	Элемент.Доступен = Истина;
	Элемент.Заголовок = НСтр("ru = 'Есть оригинал'; uk = 'Є оригінал'");
	Элемент.ЗаполнятьОбязательно = Ложь;
	Элемент.ЭтоДополнительноеСведение = Истина;
	НайденнаяСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Поступления товаров");
	Элемент.НаборСвойств = НайденнаяСсылка;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	
	ТаблицаСвойств.Вставить(СвойствоСсылка, Новый Структура("ОбъектСвойство, НаборСвойств, ИмяНабора", 
																Элемент, 
																НайденнаяСсылка, 
																"Документ_ПоступлениеТоваров"));
																
	// ЗаменаНакладной
	СвойствоСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ЗаменаНакладной;
	
	Элемент = СвойствоСсылка.ПолучитьОбъект();
	Элемент.Наименование = НСтр("ru = 'Замена накладной'; uk = 'Заміна накладної'");
	Элемент.Имя = "ЗаменаНакладной";
	Элемент.ИдентификаторДляФормул = "ЗаменаНакладной";
	Элемент.Виден = Истина;
	Элемент.ВыводитьВВидеГиперссылки = Ложь;
	Элемент.ДополнительныеЗначенияИспользуются = Ложь;
	Элемент.ДополнительныеЗначенияСВесом = Ложь;
	Элемент.Доступен = Истина;
	Элемент.Заголовок = НСтр("ru = 'Замена накладной'; uk = 'Заміна накладної'");
	Элемент.ЗаполнятьОбязательно = Ложь;
	Элемент.ЭтоДополнительноеСведение = Истина;
	НайденнаяСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Поступления товаров");
	Элемент.НаборСвойств = НайденнаяСсылка;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	
	ТаблицаСвойств.Вставить(СвойствоСсылка, Новый Структура("ОбъектСвойство, НаборСвойств, ИмяНабора", 
																Элемент, 
																НайденнаяСсылка, 
																"Документ_ПоступлениеТоваров"));
																
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка КАК Ссылка,
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.НомерСтроки КАК НомерСтроки,
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство,
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.ПометкаУдаления КАК ПометкаУдаления,
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.ИмяПредопределенногоНабора КАК ИмяПредопределенногоНабора
	               |ИЗ
	               |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	               |ГДЕ
	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Ссылка
	               |	И НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство = &Свойство";
																
																
	Для Каждого Стр Из ТаблицаСвойств Цикл 
		Запрос.УстановитьПараметр("Ссылка", Стр.Значение.НаборСвойств);
		Запрос.УстановитьПараметр("Свойство", Стр.Ключ);
		Результат = Запрос.Выполнить();		
		Если Результат.Пустой() Тогда 
			НаборСвойств = Стр.Значение.НаборСвойств.ПолучитьОбъект();		
			НовоеСвойство = НаборСвойств.ДополнительныеСведения.Добавить();
			НовоеСвойство.ИмяПредопределенногоНабора = Стр.Значение.ИмяНабора;
			НовоеСвойство.Свойство = Стр.Ключ;
	       	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборСвойств);
		КонецЕсли;																	
	КонецЦикла;
	
	
КонецПроцедуры

// см. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроек(Параметры) Экспорт
	
	//Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения);	
	
КонецПроцедуры
